validation/conventional/squareCylinder/libWallModelledLES/tests/testCases/channel_flow/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuSgs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-4;

boundaryField
{
    bottomWall
    {
/* * * * * * * * * Law of the wall wall model * * * * * * */                  
         type           MulticellLOTWWallModel;
         //type           LSQRWallModel;
  //       value            uniform 0;  //redundant
  //
         copyToPatchInternalField 1;
         RootFinder
         {
             type    Newton;
             eps     0.01;
             maxIter 10;
         }
         Law
         {
             type    Spalding;
            kappa   0.4;
            B       5.5;
       }

       sampler Crawling;
       interpolationType cell;
       hIsIndex false;
       silent false;

       

          
/* * * * * * * * * Equilibrion ODE wall model * * * * * * */                  
  //     type   PGradODEWallModel;
  //     type   EquilibriumODEWallModel;
       value   uniform 1;  //redundant
       maxIter   10;
       eps       1e-3;
       nMeshY    5;
      
       EddyViscosity
       {
            type    VanDriest;
            //type    Duprat;
            APlus   17.8;
            kappa   0.39;
       }
   }
  
   topWall
   {
   
/* * * * * * * * * OpenFOAM's default wall model * * * * * * */                  
        type            nutUSpaldingWallFunction;
        Cmu             0.09;
        kappa           0.42;
        E               8.52;
        value       uniform 0;
    }

    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
