validation/conventional/squareCylinder/libWallModelledLES/tests/testCases/channel_flow/0/wallModelSamplingMulti/bottomWall/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       scalarListListList;
    location    "0.01/wallModelSampling/bottomWall";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


9
(
1(3(1 2 3))
1(3(1 2 3))
1(3(1 2 3))
1(3(1 2 3))
1(3(1 2 3))
1(3(1 2 3))
1(3(1 2 3))
1(3(1 2 3))
1(3(1 2 3))
)


// ************************************************************************* //
