validation/conventional/squareCylinder/libWallModelledLES/tests/testCases/channel_flow/0/wallModelSamplingSingle/bottomWall/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       scalarListList;
    location    "0.01/wallModelSampling/bottomWall";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


9
(
3(1 1 1)
3(2 2 2)
3(3 3 3)
3(4 4 4)
3(5 5 5)
3(6 6 6)
3(7 7 7)
3(8 8 8)
3(9 9 9)
)


// ************************************************************************* //
