validation/conventional/squareCylinder/libWallModelledLES/tests/testCases/channel_flow/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.01;

deltaT          0.01;

writeControl    runTime;

writeInterval   0.01;

purgeWrite      1;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
}

DebugSwitches
{
//   Sampler          1;
//   MultiCellSampler 1;
//   SingleCellSampler 1;
//   wallModel        1;
//   LOTWWallModel    1;
//   LawOfTheWall     2;
//    Spalding   2;
//   ODEWallModel  2;
//   EquilibriumODEWallModel  2;
//   JohnsonKing 1;
//     SampledVelocityField 0;
//     SampledWallGradUField 1;
}



libs (
    "libOpenFOAM.so"
    "libWallModelledLES.so"
     );

// ************************************************************************* //
