validation/conventional/squareCylinder/libWallModelledLES/tests/testCases/channel_flow/system/setNutLOTWRoughLogLaw
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nut 
{
    boundaryField
    {
        bottomWall
        {
            type            LOTWWallModel;
            value           uniform 0;
            RootFinder
            {
                type    Newton;
            }
            Law
            {
                type    RoughLogLaw;
                ks      0.1;
                B       4;
            }
        }
    }
}

// ************************************************************************* //
